@echo off

chcp 65001 > nul

setlocal

echo ====================================================================

echo   ИНСПЕКЦИЯ ПОТОКОВ JVM ЧЕРЕЗ JSTACK / JPS (PYTHON)

echo   Лабораторная работа №2 по дисциплине «Параллельное программирование»

echo   Автор: Эрденко М. Д. (ПО-32б) -- Преподаватель: Степаков В. И.

echo ====================================================================

echo.

echo Внимание: Перед запуском данного скрипта запустите GUI окно

echo приложения через "2_Запуск_GUI_Окна.bat".

echo.

echo Запуск test_jstack.py...

echo --------------------------------------------------------------------

set "PYTHONIOENCODING=utf-8"
python test_jstack.py

echo.

echo [ИНФО] Инспекция завершена.

pause


